{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Convolution2D",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "linear",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "batch_input_shape": [
          null,
          1,
          128,
          216
        ],
        "bias": true,
        "border_mode": "valid",
        "dim_ordering": "th",
        "init": "glorot_uniform",
        "input_dtype": "float32",
        "name": "convolution2d_1",
        "nb_col": 4,
        "nb_filter": 64,
        "nb_row": 128,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.33,
        "name": "leakyrelu_1",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "border_mode": "valid",
        "dim_ordering": "th",
        "name": "maxpooling2d_1",
        "pool_size": [
          1,
          2
        ],
        "strides": [
          1,
          2
        ],
        "trainable": true
      }
    },
    {
      "class_name": "Reshape",
      "config": {
        "name": "reshape_1",
        "target_shape": [
          1,
          64,
          106
        ],
        "trainable": true
      }
    },
    {
      "class_name": "Convolution2D",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "linear",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "bias": true,
        "border_mode": "valid",
        "dim_ordering": "th",
        "init": "glorot_uniform",
        "name": "convolution2d_2",
        "nb_col": 4,
        "nb_filter": 128,
        "nb_row": 64,
        "subsample": [
          1,
          1
        ],
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.33,
        "name": "leakyrelu_2",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "border_mode": "valid",
        "dim_ordering": "th",
        "name": "maxpooling2d_2",
        "pool_size": [
          1,
          2
        ],
        "strides": [
          1,
          2
        ],
        "trainable": true
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "linear",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "bias": true,
        "init": "glorot_uniform",
        "input_dim": null,
        "name": "dense_1",
        "output_dim": 400,
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.33,
        "name": "leakyrelu_3",
        "trainable": true
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "p": 0.5,
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "linear",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "bias": true,
        "init": "glorot_uniform",
        "input_dim": null,
        "name": "dense_2",
        "output_dim": 400,
        "trainable": true
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "alpha": 0.33,
        "name": "leakyrelu_4",
        "trainable": true
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_2",
        "p": 0.5,
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "W_regularizer": null,
        "activation": "softmax",
        "activity_regularizer": null,
        "b_constraint": null,
        "b_regularizer": null,
        "bias": true,
        "init": "glorot_uniform",
        "input_dim": null,
        "name": "softmax",
        "output_dim": 24,
        "trainable": true
      }
    }
  ],
  "keras_version": "1.1.0"
}